rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
static ble_uuid_t m_sr_uuids[] =                                               /**< Universally unique service identifiers. */
{
    {DATA_SERVICE_BLE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}
};

//TWI Parameters
#if TWI0_ENABLED
#define TWI_INSTANCE_ID     0
#elif TWI1_ENABLED
#define TWI_INSTANCE_ID     1
#endif

static const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);
static volatile bool m_xfer_done = false; //Indicates if operation on TWI has ended.

//IMU Sensor Parameters
static stmdev_ctx_t lsm9ds1_imu;                                                /**< LSM9DS1 accelerometer/gyroscope instance. */
static stmdev_ctx_t lsm9ds1_mag;                                                /**< LSM9DS1 magnetometer instance. */
APP_TIMER_DEF(m_test_timer_id);
#define NEXT_MEASUREMENT_DELAY          APP_TIMER_TICKS(15)                     /**< Test variable used to record sensor measurements every 15 milliseconds. */

//static const uint16_t data_characteristic_size = ;
static uint8_t acc_characteristic_data[SENSOR_SAMPLES * SAMPLE_SIZE];
static uint8_t gyr_characteristic_data[SENSOR_SAMPLES * SAMPLE_SIZE];
static int16_t data_raw_accelerometer[3];
static int16_t data_raw_gyroscope[3];
static int16_t data_raw_magnetometer[3];
static float acceleration_g[3];
static float angular_rate_dps[3];
static float magnetic_field_gauss[3];
static lsm9ds1_id_t whoamI;
static lsm9ds1_status_t reg;
static uint8_t rst;
static uint8_t tx_buffer[1000];
static bool lsm9ds1_register_auto_increment = true;                            /**register auto increment function for multiple byte reads of LSM9DS1 chip **/
static int measurements_taken = 0;
static volatile bool ready_to_measure = true;

static int32_t write_imu(void *handle, uint8_t reg, const uint8_t *bufp, uint16_t len);
static int32_t read_imu(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len);
static int32_t write_mag(void *handle, uint8_t reg, const uint8_t *bufp, uint16_t len);
static int32_t read_mag(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len);
static void tx_com( uint8_t *tx_buffer, uint16_t len );
static int32_t get_IMU_data(uint8_t offset);
static int32_t get_MAG_data(uint8_t offset);

//Pin Setup
#define SENSOR_POWER_PIN        NRF_GPIO_PIN_MAP(1, 11)                         /**< Pin used to power external sensors (mapped to D2 on BLE 33)*/
#define SCL_PIN                 NRF_GPIO_PIN_MAP(1, 14)                         /**< Pin used for external TWI clock (mapped to D6 on BLE 33) */
#define SDA_PIN                 NRF_GPIO_PIN_MAP(1, 15)                         /**< Pin used for external TWI data (mapped to D4 on BLE 33) */
#define BLE_33_SENSOR_POWER_PIN NRF_GPIO_PIN_MAP(0, 22)                         /**< Pin used to power external sensors (mapped to D2 on BLE 33)*/
#define BLE_33_SCL_PIN          NRF_GPIO_PIN_MAP(0, 15)                         /**< Pin used for internal TWI clock for BLE33*/
#define BLE_33_SDA_PIN          NRF_GPIO_PIN_MAP(0, 14)                         /**< Pin used for internal TWI data for BLE33*/
#define BLE_33_PULLUP           NRF_GPIO_PIN_MAP(1, 0)                          /**< Pullup resistors on BLE 33 sense have separate power source*/
#define BLE_33_GREEN_LED        NRF_GPIO_PIN_MAP(1, 9)                          /**< Green LED Indicator on BLE 33 sense*/
#define BLE_33_RED_LED          NRF_GPIO_PIN_MAP(0, 24)                         /**< Red LED Indicator on BLE 33 sense*/




static void advertising_start(bool erase_bonds);


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            advertising_start(false);
            break;

        default:
            break;
    }
}

/**@brief Function for the LSM9DS1 initialization.
 *
 * @details Initializes the LSM9DS1 accelerometer, gyroscope and magnetometer
 */
static void lsm9ds1_init(void)
{
    //initialize read/write methods for acc./gyro.
    lsm9ds1_imu.read_reg = read_imu;
    lsm9ds1_imu.write_reg = write_imu;

    //initialize read/write methods for mag.
    lsm9ds1_mag.read_reg = read_mag;
    lsm9ds1_mag.write_reg = write_mag;

    //before trying to reach the LSM9DS1 via TWI we need to actually power it on.
    //The BLE33 sense board has multiple sensor tied to the same power pin so high drive 
    //mode needs to be enabled to ensure enough current gets to the LSM9DS1

    //uncomment to use external sensors
    //nrf_gpio_cfg_output(SENSOR_POWER_PIN);
    //nrf_gpio_pin_set(SENSOR_POWER_PIN);

    nrf_gpio_cfg_output(BLE_33_PULLUP); //send power to BLE 33 Sense pullup resistors (they aren't connected to VDD)
    nrf_gpio_pin_set(BLE_33_PULLUP);    //send power to BLE 33 Sense pullup resistors (they aren't connected to VDD)
    nrf_gpio_cfg(BLE_33_SENSOR_POWER_PIN, NRF_GPIO_PIN_DIR_OUTPUT, NRF_GPIO_PIN_INPUT_CONNECT, NRF_GPIO_PIN_NOPULL, NRF_GPIO_PIN_S0H1, NRF_GPIO_PIN_NOSENSE);
    nrf_gpio_pin_set(BLE_33_SENSOR_POWER_PIN);
    nrf_delay_ms(50); //slight delay so the chip has time to power on

    //confirm that the sensor is powered on, read the whoami register and then turn
    //on one of the board leds after a successful read
    uint32_t ret = lsm9ds1_dev_id_get(&lsm9ds1_mag, &lsm9ds1_imu, &whoamI);
    if (whoamI.imu == LSM9DS1_IMU_ID)
    {
        nrf_gpio_cfg_output(BLE_33_RED_LED); //Pin needs to be set low to turn led on
    }

