rfloyd01/PersonalCaddie/Firmware/nRF52840_Drivers/main.c
        }

        characteristic_update_and_notify();
    }
}

static int32_t read_imu(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len)
{
    //The steps for a single byte read are as follows:
    //  1. nRF52840 sends start signal by pulling the SDA line low
    //  2. nRF52840 sends 7-bit slave address followed by a 0 (write) bit
    //  3. LSM9DS1 responds with an Acknowledge
    //  4. nRF52840 sends the 8-bit address of the register it wants to read
    //  5. LSM9DS1 responds with an Acknowledge
    //  6. nRF52840 sends a repeated start signal
    //  7. nRG52840 sends 7-bit slave address followed by a 1 (read) bit
    //  8. LSM9DS1 responds with an Acknowledge
    //  9. LSM9DS1 sends the requested data
    // 10. nRF52840 responds with a non-Acknowledge and then sends the stop signal
    //Since reading the LSM9DS1 requires a repeated start signal the NRF_DRV_TWI_XFER_TXRX transfer type is used
    ret_code_t err_code = 0;

    //the primary buffer only holds the address of the register we want to read and therefore only has a length of 1 byte
    //the secondary buffer is where the data will get read into
    const nrf_drv_twi_xfer_desc_t lsm9ds1_imu_read = {
        .address = (LSM9DS1_IMU_I2C_ADD_H >> 1),
        .primary_length = 1,
        .secondary_length = (uint8_t)len,
        .p_primary_buf = &reg,
        .p_secondary_buf = bufp,
        .type =  NRF_DRV_TWI_XFER_TXRX};

    m_xfer_done = false; //set to false before any read or write operations (this gets set to true in twi_handler when the transfer is complete)

    do
    {
        err_code = nrf_drv_twi_xfer(&m_twi, &lsm9ds1_imu_read, 0); //no flags needed here
    } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
    while (m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on

    APP_ERROR_CHECK(err_code);
    return (int32_t)err_code;
}
static int32_t write_imu(void *handle, uint8_t reg, const uint8_t *bufp, uint16_t len)
{
    ret_code_t err_code = 0;

    uint8_t register_and_data[2] = {reg, bufp[0]};

    //the primary buffer will hold the register address, as well as the value to write into it.
    //for a single write operation, the secondary buffer has no use in a single write command
    const nrf_drv_twi_xfer_desc_t lsm9ds1_imu_write = {
        .address = (LSM9DS1_IMU_I2C_ADD_H >> 1),
        .primary_length = 2,
        .secondary_length = 0,
        .p_primary_buf = register_and_data,
        .p_secondary_buf = NULL,
        .type =  NRF_DRV_TWI_XFER_TX};

    m_xfer_done = false; //set to false before any read or write operations (this gets set to true in twi_handler when the transfer is complete)

    do
    {
        err_code = nrf_drv_twi_xfer(&m_twi, &lsm9ds1_imu_write, 0); //no flags needed here
    } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
    while (m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on

    APP_ERROR_CHECK(err_code);
    return (int32_t)err_code;
}
static int32_t read_mag(void *handle, uint8_t reg, uint8_t *bufp, uint16_t len)
{
    ret_code_t err_code = 0;

    //the logic for handling multiple byte reads must be handled in software for the magnetometer, whereas, the accelerometer
    //and gyroscope can do it via hardware
    const nrf_drv_twi_xfer_desc_t lsm9ds1_mag_read = {
        .address = (((uint8_t)lsm9ds1_register_auto_increment << 7) | (LSM9DS1_MAG_I2C_ADD_H >> 1)),
        .primary_length = 1,
        .secondary_length = (uint8_t)len,
        .p_primary_buf = &reg,
        .p_secondary_buf = bufp,
        .type =  NRF_DRV_TWI_XFER_TXRX};

    m_xfer_done = false; //set to false before any read or write operations (this gets set to true in twi_handler when the transfer is complete)

    do
    {
        err_code = nrf_drv_twi_xfer(&m_twi, &lsm9ds1_mag_read, 0); //no flags needed here
    } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
    while (m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on

    APP_ERROR_CHECK(err_code);
    return (int32_t)err_code;
}
static int32_t write_mag(void *handle, uint8_t reg, const uint8_t *bufp, uint16_t len)
{
    ret_code_t err_code = 0;

    uint8_t register_and_data[2] = {reg, bufp[0]};

    //the primary buffer will hold the register address, as well as the value to write into it.
    //for a single write operation, the secondary buffer has no use in a single write command
    const nrf_drv_twi_xfer_desc_t lsm9ds1_mag_write = {
        .address = (LSM9DS1_MAG_I2C_ADD_H >> 1),
        .primary_length = 2,
        .secondary_length = 0,
        .p_primary_buf = register_and_data,
        .p_secondary_buf = NULL,
        .type =  NRF_DRV_TWI_XFER_TX};

    m_xfer_done = false; //set to false before any read or write operations (this gets set to true in twi_handler when the transfer is complete)

    do
    {
        err_code = nrf_drv_twi_xfer(&m_twi, &lsm9ds1_mag_write, 0); //no flags needed here
    } while (err_code == 0x11); //if the nrf is currently busy doing something else this line will wait until its done before executing
    while (m_xfer_done == false); //this line forces the program to wait for the TWI transfer to complete before moving on

    APP_ERROR_CHECK(err_code);
    return (int32_t)err_code;
}

static void tx_com( uint8_t *tx_buffer, uint16_t len )
{
    int x = 5;
}

static int32_t get_IMU_data(uint8_t offset)
{
    //Reads the raw accelerometer and magnetometer data and stores it in their respective arrays
    int ret = 0; 

    if (lsm9ds1_register_auto_increment)
    {
        ret = lsm9ds1_read_reg(&lsm9ds1_imu, LSM9DS1_OUT_X_L_G, gyr_characteristic_data + offset, 6);

        if (ret == 0)
        {
            //SEGGER_RTT_printf(0, "Base Characteristic Address: 0x%#08x\n", acc_characteristic_data);
            //SEGGER_RTT_printf(0, "Address after offset: 0x%#08x\n", acc_characteristic_data + offset);
            ret = lsm9ds1_read_reg(&lsm9ds1_imu, LSM9DS1_OUT_X_L_XL, acc_characteristic_data + offset, 6);
        }
    }
    else
    {
        //implement this at some point
    }
    
    

    return ret;
}

static int32_t get_MAG_data(uint8_t offset)
{
    //Reads the raw magnetometer data and stores it in its respective array
    int ret = 0;
    
    if (lsm9ds1_register_auto_increment)
    {
        ret = lsm9ds1_magnetic_raw_get(&lsm9ds1_mag, data_raw_magnetometer + offset);
    }
    else
    {
        //implement this at some point
    }

    return ret;
}

/**
 * @}
 */
